Revit 2026 API

# VertexStreamPosition Methods

---

The VertexStreamPosition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddVertex | Inserts a VertexStreamPosition into the stream and associated buffer. |
|  | AddVertices |  |
|  | Dispose | (Inherited from VertexStream) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

VertexStreamPosition Class

Autodesk.Revit.DB.DirectContext3D Namespace